# 정답 데이터 만들기  // 커피 차

# df.loc[df['prdName'].str.contains("사과","과"), "분류"] = "사과"

df.loc[df['prdName'].str.contains("모카골드","블랙커피","맥심","프렌치카페","커피","카누","라떼","아메리카노","맥스웰","모카","로스트","다비도프","콜롬비아","카페","조지아","이디야","스타벅스","커피믹스","블랙커피","믹스커피","원두커피","캡슐커피","에티오피아","카페인"), "분류"] = "커피"
df.loc[df['prdName'].str.contains("쌍화","오미자","미숫가루","율무차","말차","자몽청","유자청","보리차","옥수수차","홍차","녹차","결명자차","호박팥차","우엉차","허브차","여주차","둥글레","작두콩","캐모마일","메밀차","유자차","코코아","민트","라이트티","아이스티","티백","로즈마리","감자차","생강차","비트차","순차","페퍼민트","런던프룻","감태차"), "분류"] = "차"
df.loc[df['prdName'].str.contains("꿀"), "분류"] = "꿀"
df.loc[df['prdName'].str.contains("꿀"), "분류"] = "꿀"


df