class Classifier:

    # 축산
    def meat(self,string):
        # 닭가슴살
        for i in ["닭가슴살"]:
            if i in string: return "닭가슴살"   
        # 닭고기         
        for i in ["닭","윙","영계","삼계탕"]:
            if i in string: return "닭고기"
        # 한우
        for i in ["한우"]:
            if i in string: return "한우" 
        # 소고기
        for i in ["살치살","꽃갈비","부채살","생갈비","소","갈비살"]:
            if i in string: return "소고기"
        # 오리고기
        for i in ["오리","로스","훈제오리"]:
            if i in string: return "오리고기"
        # 수입육
        for i in ["호주","돈마호크","미국","바로구이","유럽","USDA","LA"]:
            if i in string: return "수입육"
        # 돼지고기
        for i in ["돼지","삼겹살","삼겹","오겹","포크","한돈","차돌","목살","대패","백두","잡채","장조림","갈매기"]:
            if i in string: return "돼지고기"
        # 가공육
        for i in ["간장","양념","떡갈비","불고기","닭갈비","쪽갈비","고추장","훈제","함박","돈까스","카츠","탕수육","너겟","소시지","수제","소세지","순대","만두","치킨","킬바사","샤브","바베큐","미트볼","편육","꼬치","엄마","매콤","간편","캠핑","족발"]:
            if i in string: return "가공육"
        # 계란/알류
        for i in ["달걀","반숙란","구운란","계란","메추리"]:
            if i in string: return "계란/알류"
        # 기타정육
        for i in ["곱창","막창","양","수제"]:
            if i in string: return "기타정육"

        return "기타정육"

    # 채소
    def veget(self, string):
        # 토란
        for i in ["토란"]: 
            if i in string: return "토란"
        # 마늘
        for i in ["마늘"]: 
            if i in string: return "마늘"
        # 양파
        for i in ["양파"]:
            if i in string: return "양파"
        # 대파
        for i in ["대파"]:
            if i in string: return "대파"
        # 쪽파
        for i in ["쪽파"]:
            if i in string: return "쪽파"
        # 생강
        for i in ["생강"]:
            if i in string: return "생강"
        # 당근
        for i in ["당근"]:
            if i in string: return "당근"
        # 연근
        for i in ["연근"]:
            if i in string: return "연근"
        # 호박
        for i in ["호박"]:
            if i in string: return "호박"
        # 감자
        for i in ["감자"]: 
            if i in string: return "감자"
        # 고구마
        for i in ["고구마","구마","말랭이"]: 
            if i in string: return "고구마"
        #옥수수
        for i in ["옥수수"]:
            if i in string: return "옥수수"
        # 마/우엉
        for i in ["참마","장마","산마","야콘","우엉"]:
            if i in string: return "마/우엉"
        #가지
        for i in ["가지"]: 
            if i in string: return "가지"
        #오이
        for i in ["오이","생수세미"]: 
            if i in string: return "오이"
        # 파프리카
        for i in ["파프리카","스위트파피"]:   
             if i in string: return "파프리카"
        #브로콜리
        for i in ["브로콜리","콜리"]:  
            if i in string: return "브로콜리"
        #피망
        for i in ["피망"]:  
            if i in string: return "피망"
        # 샐러드채소
        for i in ["로메인","카이피라","레터스","비트","파슬리","이자트릭스","프릴아이스","스탠포드","신선초","알로에","바질","콜라비"]:   
            if i in string: return "샐러드채소"
        # 샐러리
        for i in ["샐러리","케일","아스파라거스"]: 
            if i in string: return "샐러리"
        # 양상추
        for i in ["양상추", "양상"]:
            if i in string: return "양상추"
        # 양배추
        for i in ["양배추", "양배"]:
            if i in string: return "양배추"
        # 상추/깻잎
        for i in ["적상추","청상추","혼합 상추","포기 상추", "깻잎"]:            
            if i in string: return "상추/깻잎"
        # 쌈채소
        for i in ["알배기","쌈채소","쌈","적겨자","당귀","쌈추","치커리","새싹삼","청경채","향나물","치콘","참나물","레디쉬","근대","고수","쌈케일"]:            
            if i in string: return "쌈채소"
        #고추
        for i in ["고추", "고춧가루"]:    
            if i in string: return "고추"
        # 무
        for i in ["알타리","열무","절단 무","월동무","세척무","무우"]: 
            if i in string: return "무"
        # 배추/절임배추
        for i in ["배추","절임","우거지"]:  
            if i in string: return "배추/절임배추"
        #얼갈이
        for i in ["얼갈이","홍갓","청갓"]: 
            if i in string: return "얼갈이"
        #버섯
        for i in ["버섯","동충하초","표고","느타리","새송이"]: 
            if i in string: return "버섯"
        # 해초
        for i in ["미역","다시마","톳","꼬시래기"]:
            if i in string: return "헤초"
        # 나물
        for i in ["죽순","시래기","고사리","토란대","궁채나물","나물","우거지","곤드레","콩나물","봄동"]:   
            if i in string: return "나물"
        # 반찬채소
        for i in ["시금치","부추","미나리","국거리채소","생나물","쑥갓","달래","세발나물","취나물","깻순","유채","공심채","돌나물","도라지","돌산갓","머위잎","방풍나물","신선초","고구마순","나물"]:
            if i in string: return "반찬채소"        
        # 샐러드
        for i in ["샐러드","무순","어린잎","채소믹스","드레싱","오크라","야채믹스","믹스","스피아민트","레드키드니빈","페퍼민트","완두순","칙피","레몬그라스","새싹","궁채"]: 
            if i in string: return "샐러드"
        # 인삼/더덕/약선재료
        for i in ["석류","수삼","즙","삼","더덕","장뇌삼","흑화고","속편해","수삼"]:
            if i in string: return "인삼/더덕/약선재료"
        # 토마토
        for i in ["토마토", "마토"]:
            if i in string: return "토마토"
        # 마/우엉
        for i in ["마"]:
            if i in string: return "마/우엉"
        # 무
        for i in ["무"]: 
            if i in string: return "무"            

        return "기타채소"

    # 제과/빵
    def pastry(self,string):
        # 과자
        for i in ["에이스","새우깡","포스틱","포테이토","꿀꽈배기","오징어칩","조청유과","포테토칩","꼬북칩","예감","고래밥","동일식품","고소미","모나카","대용량","해태","농심","오리온",
"크라운","롯데","초코송이","에이스","오예스","맛동산","허니버터칩","후렌치파이","오사쯔","하비스트","산도","제크","콘초","콘치","봉지","크라운산도","크라운","예감",
"과자","뻥튀기","로투스","맛밤","스낵","산도크림","롱롱스","짱구","빠다코코낫","달군감자","콘스낵","약과","꿀약과","꿀이구마","에낙","두부과자","미스티","무설탕",
"인기과자","카스타드","감자칩","죠리퐁","왕소라","전병","쌀과자골드","쌀과자","쌀대롱","불량식품","봉지스낵","사브레","쫀디기",
"스콘","누룽지","크래커","썬","크래커","송이모자","수입과자","땅콩보리과자","뻥튀기","강정","정과","강냉이","코코퍼프","홈런볼","콩과자","누룽칩","오즈","오징어땅콩","아이비","해태제과","한과","웰빙","뿌셔뿌셔","화과자","크리스프","두부과자","사루비아"]:
            if i in string: return "과자"
        # 튀김류
        for i in ["튀김"]:
            if i in string: return "튀김류"
        # 커피
        for i in ["커피믹스","아메리카노"]:
            if i in string: return "커피"
        # 시리얼
        for i in ["오란다","오곡","철분바","식사","씨리얼","채소미","시리얼","귀리","청크","오트랄라","영양바","오트밀","단백질바",
"그래놀라","닥터유","크리스피","시리얼","프로틴바","에너지바","요거트바","밀크바","곡물","곡물롤"]:
            if i in string: return "시리얼"
        # 쿠키
        for i in ["비스킷","키드오","시트러스","마들렌","감자","버섯칩","초코칩","코코넛칩","와플","맛밤",
"버터링","하임","칙촉","쿠크다스","바삭","바삭바삭","아몬드바","쿠키","다이제","샌드","다이제씬",
"빼빼로","포키","통크","삼양","오레오","비스켓","예감","제크","버터","수제","간식","달고넛","파이","엄마손",
"제이엘","크래커","브리틀","크런치","사과칩","코코넛","크린베리","피스터치오","피스타치오"]:
            if i in string: return "쿠키"
        # 초콜릿
        for i in ["킨더조이","고디바","린도볼","브라우니","워커스","몰티져스","로아커","블랙백",
"고메","린트","린도볼","킨더조이","마즈","스누피","펀사이즈","킨더","앤디스","몰티져스","크런키",
"가나","스위트","초코바","초코볼","ABC","허쉬","페레로","쵸코","시쉘",
"트윅스","몽쉘","엠앤엠즈","길리안","키세스","가데나","쇼콜라","누텔라","씨씨쉘",
"드림카카오","티라미슈","초코파이","티라미수","킷캣","버릴스","비바니","생초콜릿","쵸콜릿",
"쵸콜렛","초콜릿","초콜렛","수제쵸콜릿","수제쵸콜렛","수제초콜릿","수제초콜렛","자유시간",
"초코렛","쵸코렛","초코비","쿠키앤크림"]:
            if i in string: return "초콜릿"
        # 젤리/푸딩
        for i in ["풋젤리","마쉬멜로우","곤약","마이쮸","마이쭈","새콤달콤","양갱","곰돌이구미","쫀드기","콜라겐","하리보","구미","알맹이","멜로우","젤리","왕꿈틀이","사워","크롤러","열대과일맛","드링크젤리","머쉬멜로우","베베토"]:
            if i in string: return "젤리/푸딩"
        # 간식/소시지
        for i in ["천하장사","육포","소고기","돼기고기","오리고기","간식"]:
            if i in string: return "간식/소시지"
        # 껌
        for i in ["껌","자일리톨","껌","리필"]:
            if i in string: return "껌"
        # 빵
        for i in ["통밀빵","도라야끼","단팥","수제빵","브레드","술빵","냉동빵","팬케이크","카스테라","감자빵","고구마빵","샌드위치",
"식빵","미니붕어빵","만쥬","삼립","도너츠""꽈배기","미주라""붕어빵","국화빵","크로와상","생지","크로플","삼림","꿀떡","피자","바게트","마늘빵","찐빵","메이플피칸","에어프라이어","케이크","산소빵","롤케이크","도넛",
"프랑스빵","케잌","케익","포켓몬빵","경주빵","찰보리빵","보리빵","치즈케이크","건빵","모닝빵","건강빵","안흥찐빵","소금빵","시오빵","찰지구마빵","러스크","마카롱","카롱","마카롱","레터링마카롱","포토마카롱"]:
            if i in string: return "빵"
        # 떡
        for i in ["술떡","쑥찰떡","단호박떡","치즈떡","쑥개떡","길쭉이","찰떡","송편","바람떡","호떡","쑥떡","콩고물","모찌","찐개떡","개떡",
"흑임자","동부기피","인절미","찹쌀떡","백설기","떡","더블떡","보리떡","가래","절편","쑥인절미","절편","절편","절편","절편","후르츠떡"]:
            if i in string: return "떡"
        # 캔디
        for i in ["솜사탕","포도당","쌀엿","말랑카우","후르트","바이츠","카라멜","캔디","스탬프","키링","사탕","츄파츕스",
"후르티","이클립스","멘토스","아이스브레이커스","달고나","목캔디","막대","계피","엿","뽀로로","캔디블럭","벌크캔디","사탕","스위트캔디","캔디블럭","프루팁스"]:
            if i in string: return "캔디"
        # 아이스크림
        for i in ["아이스크림","파인트","끌레도르","빙그레","빵또아","쌍쌍바","누가바","메로나","비비빅","투게더","유기농아이스크림","빙수","쿠앤크"]:
            if i in string: return "아이스크림"
        # 소스
        for i in ["소스"]:
            if i in string: return "소스"
        # 빵
        for i in ["빵", "삽림", "삼립"]:
            if i in string: return "빵"
        # 아이스크림            
        for i in ["바", "콘"]:
            if i in string: return "아이스크림"
        # 떡
        for i in ["떡"]:
            if i in string: return "떡"

        return "기타제과"

    # 쌀/잡곡
    def ssal(self, string):
        # 콩
        for i in ["병아리콩","잡곡콩","렌틸콩","검정콩","강낭콩","완두콩","검은콩","흰강낭콩",
"볶음콩","햇콩","작두콩","홍작두","백작두","도두콩","약콩","서리태","볶음콩",]:
            if i in string: return "콩"
        # 쌀
        for i in ["우리쌀", "기장쌀", "경기미", "수향미", "추청미", "쌀", "안성쌀", "곤약미", "일품쌀", "여주",
 "삼광", "백진주", "신동진쌀", "오대쌀", "이천쌀", "생명쌀", "농협쌀", "고급쌀", "명월쌀", 
"오대미", "맑은쌀", "멥쌀", "햅쌀", "수수쌀", "황금쌀", "경기", "고시히카리", "경기", "쌀눈쌀", 
"GAP", "집밥", "맑은 쌀"]:
            if i in string: return "쌀"
        # 현미
        for i in ["현미", "찰현미", "발아현미", "현미쌀", "고향찰현미", "국산현미", "햇현미", ]:
            if i in string: return "현미"
        # 흑미
        for i in ["흑미", "찰흑미", "찰흑현미", "찹쌀흑미"]:
            if i in string: return "흑미"
        # 잡곡
        for i in ["보리쌀", "찰보리", "퀴노아", "통밀", "햅곡", "혼합", "오곡", "보리", "귀리쌀", "귀리", "녹두", 
"햄프씨드", "오트밀", "잡곡밥", "슈퍼푸드", "오곡밥", "좁쌀", "가바쌀", "적미", "홍미", 
"오곡밥", "잡곡", "새모이", "모조", "곡물", "카무트"]:
            if i in string: return "잡곡"
        # 견과
        for i in ["모듬견과", "칼집", "스테비아", "깐밤", "마른안주", "잣", "호두", "믹스넛", "너트", "꿀밤", "단밤", 
"알밤", "햇밤", "올넛", "아몬드", "약단밤", "땅", "국산밤", "피스타치오", "볶음땅콩", 
"캐슈넛", "조생밤", "피칸", "베리스", "썬키스트견과", "견과", "하루견과", "먼투썬"]:
            if i in string: return "견과"
        # 건조식품
        for i in ["취포구이채", "오징어다리", "롱다리", "대왕발", "봉동생강마을", "어포", "아구포", "숏다리", "프로틴", "우엉", 
"표고", "황태", "고춧가루", "수제", "생강", "편강", "도라지", "야채", "야채칩", "건조", "고구마", "망고", 
"칩", "씨앗", "오징어", "쥐포", "안주", "한치", "바삭", "건어물", "분말", "에리스리톨", "누룽지", "가마솥누룽지", 
"건어물", "반건조", "건나물", "김부각", "건조나물", "김스낵", "샌드위치김", "샌드위치김", "꼬리포", 
"가루", "율무", "시래기", "부지갱이", "방풍나물"]:
            if i in string: return "건조식품"
        # 건조과일
        for i in ["건조과일칩", "건조과일", "파인애플", "블루베리", "망고", "자두", "곶감", "베리", "포도", 
"홍시", "단감", "건시", "과일", "감말랭이", "월하시감", "발효곶감", "감", "체리" ]:
            if i in string: return "건조과일"
        # 깨
        for i in ["깨", "통들깨", "참깨", "참깨", "들깨", "참깨", "검정깨", "깨알톡톡", ]:
            if i in string: return "깨"
        # 씨앗
        for i in ["새싹", "씨앗", "호박씨", "해바라기씨","은행", "피은행", "아마씨", "보리씨앗"]:
            if i in string: return "씨앗"
        # 무농약/유기농
        for i in ["무농약","유기농"]:
            if i in string: return "유기농"
        # 콩
        for i in ["콩"]:
            if i in string: return "콩"       
        # 쌀
        for i in ["쌀"]:
            if i in string: return "쌀"
        # 쌀
        for i in ["밤"]:
            if i in string: return "견과"  
        # 조  
        for i in ["조"]:
            if i in string: return "조"                

        return "기타잡곡"

    # 수산/건어물
    def fish(self, string):
        # 가자미
        for i in ["가자미", "홍어", "가오리"]:
            if i in string: return "가자미"
        # 갈치/삼치/고등어
        for i in ["갈치", "삼치", "고등어", "박대"]:
            if i in string: return "갈치/삼치/고등어"
        # 구색선어
        for i in ["민물장어", "꽁치", "아귀", "전어", "도미", "우럭", "병어", "민어", "양미리", "옥돔", "복어", "과매기", "대구", "어란", "조기", "임연수", "꽃돔", "감성돔", "선어", "병어", "빙어", "방어", "장어", "꼬시래기", "북어", "적어", "전갱이"]:
            if i in string: return "구색선어"
        # 연어/참치
        for i in ["연어","참치"]:
            if i in string: return "연어/참치"
        # 동태/명태
        for i in ["동태","명태","코다리"]:
            if i in string: return "동태/명태"
        # 알/해삼
        for i in ["명란", "개불", "성게", "해삼", "날치"]:
            if i in string: return "알/해삼"
        # 갑각류
        for i in ["크랩", "랍스터", "랍스타", "홍게", "꽃게"]:
            if i in string: return "갑각류"
        # 어패류
        for i in ["홍합", "바지락", "고동", "골뱅이", "다슬기", "관자", "굴", "전복", "가리비", "꼬막", "조개", "우렁", "소라", "석화", "피조개", "대합", "거북손", "동죽"]:
            if i in string: return "어패류"
        # 건어물
        for i in ["우육포", "진미채", "과메기", "멸치", "쥐포", "황태", "아귀포", "숏다리", "진짜바삭한", "코주부", "오족", "명업채", "건보리", "왕다리", "홍진미", "진미", "왕대발", "뱅어포", "마른안주", "먹태", "한치", "수염새우", "땅콩버터", "빠삭", "장족", "안주", "꾸이"]:
            if i in string: return "건어물"
        # 김/파래김
        for i in ["돌자반", "자반", "파래", "조미김", "김가루", "미역", "매생이", "다시", "감태"]:
            if i in string: return "김/파래김"
        # 새우
        for i in ["새우"]:
            if i in string: return "새우"
        # 오징어/문어
        for i in ["오징어", "징어", "꼴뚜기", "한치", "문어"]:
            if i in string: return "오징어/문어"
        # 낙지/쭈꾸미
        for i in ["낙지", "주꾸미", "쭈꾸미", "쭈구미"]:
            if i in string: return "낙지/쭈꾸미"
        # 알/해삼
        for i in ["알"]:
            if i in string: return "알/해삼"
        # 갑각류
        for i in ["게", "대게"]:
            if i in string: return "갑각류"   
        # 건어물
        for i in ["건"]:
            if i in string: return "건어물"  
        # 김/파래김
        for i in ["김"]:
            if i in string: return "김/파래김"      
        
        return "기타수산물"

    # 면류/레트로식품
    def retro(self, string):
        # 밀키트
        for i in ["쿠킹","밀키트"]:
            if i in string: return "밀키트"
        # 라면
        for i in ["짜파게티", "라면", "육개장", "사발면", "컵라면", "열라짬뽕", "농심", "오뚜기", "팔도", "소컵", "삼양", "라멘", "로스팅짬뽕", "생생우동", "진라면", "신라면"]:
            if i in string: return "라면"
        # 통조림
        for i in ["골뱅이", "수산캔", "황도", "백도", "스위트콘", "캔", "꽁치캔", "꽁치 캔", "꼬막", "번데기", "조림"]:
            if i in string: return "통조림"
        # 국/탕/찜
        for i in ["찌개", "탕", "국", "전골", "짜글이", "청국장", "사골", "육수", "개장", "삼계탕", "육개장", "해물찜"]:
            if i in string: return "국/탕/찜"
        # 고추장/된장/간장
        for i in ["쌈장", "고추장", "된장", "간장", "초장" ]:
            if i in string: return "고추장/된장/간장"    
        # 피자/핫도그
        for i in ["핫도그","피자"]:
            if i in string: return "피자/핫도그"
        # 떡볶이/떡사리
        for i in ["떡볶이", "떡볶이 떡", "떡복이", "라볶이", "볶이", "누들"]:
            if i in string: return "떡볶이/떡사리"
        # 만두
        for i in ["만두", "군만두", "교자", "얇은피", "샤오롱", "바오", "하가우", "딤섬", "감자떡", "메밀전병", "창편", "찐빵", "슈마이", "전병",  "꽃빵",   "아하식품",  "손만두"]:
            if i in string: return "만두"
        # 너겟/치킨/돈까스
        for i in ["너겟", "후라이드", "까스", "카츠", "돈까스", "등심", "윙봉", "치킨", "용가리", "탕수육", "버팔로", "텐더", "스모크"]:
            if i in string: return "너겟/치킨/돈까스"
        # 떡갈비/함박스테이크
        for i in ["떡갈비", "동그랑땡", "찹스테이크", "스테이크", "완자", "갈비", "너비아니", "함박", "돼지갈비", "미트볼"]:
            if i in string: return "떡갈비/함박스테이크"
        # 오일/기름
        for i in ["오일", "기름", "카놀라유", "포도씨유","식용유"]:
            if i in string: return "오일/기름"
        # 베이컨/소시지
        for i in ["소세지", "소시지", "베이컨", "후랑크", "하몽", "비엔나", "프랑크", "킬바사", "옛날소시지", "부어스트", "김밥 햄", "김밥햄", "핫도그"]:
            if i in string: return "베이컨/소시지"
        # 어묵/크래미
        for i in ["어묵", "오뎅", "크레미", "크래미", "맛살", "게살", "랍스터", "크리비아", "크랩", "크라비아", "사각"]:
            if i in string: return "어묵/크래미"
        # 소스
        for i in ["소스", "데리야끼", "와사비", "겨자", "불닭소스", "캡사이신"]:
            if i in string: return "소스"
        # 시럽/잼          
        for i in ["시럽", "딸기"]:
            if i in string: return "시럽/잼"
        # 볶음/구이
        for i in ["볶음", "구이", "짜박이", "불고기"]:
            if i in string: return "볶음/구이"
        # 즉석밥
        for i in ["햇반", "곤약밥", "컵밥", "누룽지"]:
            if i in string: return "즉석밥"
        # 참치
        for i in ["참치"]:
            if i in string: return "참치캔"
        # 드레싱
        for i in ["드레싱"]:
            if i in string: return "드레싱" 
        # 고춧가루
        for i in ["고춧가루"]:
            if i in string: return "고춧가루"           
        # 제빵믹스
        for i in ["호떡", "팬케이크", "만들기", "초코스틱", "핫케이크"]:
            if i in string: return "제빵믹스"  
        # 소금/설탕
        for i in ["소금", "설탕", "스테비아", "맛소금", "솔트", "슈거", "슈가", "천일염"]:
            if i in string: return "소금/설탕"
        # 식초/물엿
        for i in ["물엿", "식초", "조청"]:
            if i in string: return "식초/물엿"  
        # 맛술/액젓
        for i in ["맛술","액젓"]:
            if i in string: return "맛술/액젓"
        # 다시마/미원
        for i in ["연두", "조미료", "다시마", "다시다", "치킨스톡"]:
            if i in string: return "다시다/미원"  
        # 안주/전류
        for i in ["닭발", "순대", "오징어입", "폭립", "닭갈비", "곱창", "족발", "무뼈","닭꼬치", "막창", "소금구이", "산적", "편육", "다코야끼", "깐풍기", "타코야끼", "타꼬야끼", "프로슈토"]:
            if i in string: return "안주/전류"
        # 죽/스프
        for i in ["죽", "양반죽", "스프"]:
            if i in string: return "죽/스프"        
        # 튀김류
        for i in ["튀김","멘보샤","빵가루","고로케","김말이"]:
            if i in string: return "튀김류"
        # 시리얼
        for i in ["코코볼", "켈로그", "콘푸라이트", "콘후레이크", "후레이크", "그래놀라"]:
            if i in string: return "시리얼"  
        # 카레/짜장
        for i in ["카레", "커리", "짜장", "하이라이스"]:
            if i in string: return "카레/짜장"
        # 도시락
        for i in ["도시락"]:
            if i in string: return "도시락"  
        # 닭가슴살
        for i in ["닭가슴살"]:
            if i in string: return "닭가슴살"
        # 꿀
        for i in ["꿀","메밀","벌꿀","벌집"]:
            if i in string: return "꿀"  
        # 깨
        for i in ["깨", "께", "참깨", "들깨"]:
            if i in string: return "고춧가루/참깨"
        # 캔
        for i in ["스팸", "리챔", "햄", "로스팜"]:
            if i in string: return "캔"            
        # 안주/전류
        for i in ["전"]:
            if i in string: return "안주/전류"
        # 소금/설탕(추가)
        for i in ["염"]:
            if i in string: return "소금/설탕"
        # 제빵믹스
        for i in ["빵"]:
            if i in string: return "제빵믹스"    
        # 즉석밥
        for i in ["밥"]:
            if i in string: return "즉석밥"    
        # 시럽/잼          
        for i in ["잼"]:
            if i in string: return "시럽/잼"          
        for i in ["하림"]:
            if i in string: return "너겟/치킨/돈까스"       
        # 국/탕/찜
        for i in ["찌개","된장","국","탕","짜글이","찌개","청국장","삼계탕","육개장","해물찜"]:
            if i in string: return "국/탕/찜"  
        # 면류
        for i in ["국수","모밀","국수","우동","가락","수제비","칼국수","소바","쌀국수","가쓰오","짜장","짬뽕","유니","파스타","스파게티"]:
            if i in string: return "면류"        
        return "기타식품"  

    # 우유/냉장/냉동
    def mik_ref(self, string):
        # 우유
        for i in ["우유", "매일","고칼슘","프로틴","저지방","밀크","하얗다","허쉬","라떼","빙그레","초코우유","오트"]:
            if i in string: return "우유"
        # 두유/아몬드유
        for i in ["두유", "뉴케어", "단백질음료", "베지밀","아몬드브리즈","아몬드유"]: 
            if i in string: return "두유/아몬드유"
        # 요거트/요구르트
        for i in ["요구르트","유제품","요거트","요플레","액티비아","그릭","플레인","비피더스","엔요","야쿠르트","불가리스","이오","요거","비요뜨","세브란스","유산균","또떠불","파스퇴르"]: 
            if i in string: return "요거트/요구르트"
        #############냉장/냉동###############
        # 반찬
        for i in ["반찬","깻잎","자반","진미채","장아찌","회무침","게장","자반","간장","오이지","피클","부각"]:
            if i in string: return "반찬"
        # 튀김류
        for i in ["튀김","멘보샤","빵가루","고로케","김말이"]:
            if i in string: return "튀김류"
        # 떡갈비/함박스테이크
        for i in ["떡갈비","동그랑땡","찹스테이크","스테이크","완자","갈비","너비아니","함박","돼지갈비","미트볼"]:
            if i in string: return "떡갈비/함박스테이크"    
        # 피자/핫도그
        for i in ["피자","브리또","고르곤","페페로니","부리또","화덕","시카고","핫도그","소떡","또띠아","도그"]:
            if i in string: return "피자/핫도그"   
        # 도시락
        for i in ["도시락"]:
            if i in string: return "도시락"       
        # 국/탕/찜
        for i in ["찌개","짜글이","청국장","삼계탕","육개장","해물찜"]:
            if i in string: return "국/탕/찜"   
        # 김치/젓갈
        for i in ["김치","석박지","총각","깍두기","젓갈","섞박지","무생채","젓","묵은지","동치미","무말랭이","배추","절임"]:
            if i in string: return "김치/젓갈" 
        # 떡볶이/떡사리
        for i in ["떡볶이","떡볶이 떡","라볶이","볶이","누들"]:
            if i in string: return "떡볶이/떡사리"
        # 면류
        for i in ["국수","모밀","국수","우동","가락","수제비","칼국수","소바","쌀국수","가쓰오","짜장","짬뽕","유니","파스타","스파게티"]:
            if i in string: return "면류"
        # 볶음/구이
        for i in ["볶음","구이","짜박이","불고기"]:
            if i in string: return "볶음/구이"
        # 만두
        for i in ["만두","군만두","교자","얇은피","샤오롱","바오","하가우","딤섬","감자떡","메밀전병","창편","찐빵","슈마이","전병","꽃빵","아하식품","손만두"]:
            if i in string: return "만두"
        # 어묵/크래미
        for i in ["어묵","오뎅","크레미","크래미","맛살","게살","랍스터","크리비아","크랩","크라비아","사각"]:
            if i in string: return "어묵/크래미"
        # 베이컨/소시지
        for i in ["소세지","소시지","베이컨","후랑크","하몽","비엔나","프랑크","킬바사","옛날소시지","부어스트","김밥 햄","김밥햄","핫도그"]:
            if i in string: return "베이컨/소시지"
        # 밀키트
        for i in ["부대찌개","밀키트","바싹불고기","샤브","두루치기","홈밀","캠핑","파티"]:
            if i in string: return "밀키트"
        # 두부/유부
        for i in ["두부","유부"]:
            if i in string: return "두부/유부"
        # 계란/알류
        for i in ["계란","특란","해밀","목초란","구운란","반숙란"]:
            if i in string: return "계란/알류"
        # 냉동생지
        for i in ["생지"]:
            if i in string: return "냉동생지"
        # 냉동과일
        for i in ["과일","사과","딸기","망고","파인애플","바나나","후르츠","라임"]:
            if i in string: return "냉동과일"
        # 아이스크림
        for i in ["조안나","콘","파인트","하겐다즈","바닐라","그린티","카라멜","아이스","탱크보이","폴라포","라라스윗"]:
            if i in string: return "아이스크림"
        # 과일/야채음료
        for i in ["주스","아침에","따옴","오렌지","포도","덴마크"]:
            if i in string: return "과일/야채음료"
        # 샌드위치/버거
        for i in ["샌드위치","버거"]:
            if i in string: return "샌드위치/버거"
        # 닭가슴살
        for i in ["닭가슴살"]:
            if i in string: return "닭가슴살"
        # 맛집
        for i in ["매드포갈릭","투썸","애슐리","빕스","던킨","아웃백"]:
            if i in string: return "맛집"
        # 젤리/푸딩
        for i in ["젤리","코코","쁘띠","타피오카","펄"]:
            if i in string: return "젤리/푸딩"
        # 오일/기름
        for i in ["오일","기름","카놀라유","포도씨유","식용유"]:
            if i in string: return "오일/기름"
        # 요거트/요구르트(추가)
        for i in ["장","위","간","풀무원","발효"]: 
            if i in string: return "요거트/요구르트"
        # 치즈/버터
        for i in ["휘핑","치즈","체다","크림","버터","모짜렐라"]: 
            if i in string: return "치즈/버터"
        # 돈까스/너겟/치킨
        for i in ["너겟","후라이드","까스","카츠","돈까스","등심","윙봉","치킨","용가리","순살","탕수육","안심","버팔로","텐더","하림","스모크","닭"]:
            if i in string: return "돈까스/너겟/치킨"     
        # 감자튀김/치즈스틱
        for i in ["치즈스틱","웨지","치즈볼","감자","냉동감자","해쉬"]:
            if i in string: return "감자튀김/치즈스틱"
        # 볶음밥/덮밥/죽
        for i in ["라이스","볶음밥","비빔밥","밥","죽","리조또","햇반","덮밥","곤약","국밥","스프","수프"]:
            if i in string: return "볶음밥/덮밥/죽" 
        # 안주/전류
        for i in ["닭발","순대","오징어입","폭립","닭갈비","곱창","족발","전","무뼈","닭꼬치","막창","소금구이","산적","김말이","편육","다코야끼","깐풍기","타코야끼","타꼬야끼","프로슈토"]:
            if i in string: return "안주/전류" 
        # 국/탕/찜
        for i in ["찌개","된장","국","탕","짜글이","찌개","청국장","삼계탕","육개장","해물찜"]:
            if i in string: return "국/탕/찜" 
        # 면류
        for i in ["면","사리"]:
            if i in string: return "면류"

        return "기타식품"

    # 생수/커피/음료
    def water(self, string):
        #전통음료
        for i in ["식혜", "수정과"]:
            if i in string: return "전통음료"
        #이온음료
        for i in ["이온", "포카리","파워에이드"]:
            if i in string: return "이온음료"
        #과일/야채음료
        for i in ["오렌지", "드링크", "사과", "주스", "쥬스", "포도", "복숭아", "망고", "토마토", "카프리썬", "덴마크", "델몬트", "해태음료", "썬키스트", "알로에", "배도라지", "당근", "착즙", "코코팜", "딸기", "피크닉", "썬업", "젤리", "석류", "음료", "코코넛", "과채", "모구모구", "농장", "젤리"]:
            if i in string: return "과일/야채음료"
        #탄산
        for i in ["콜라", "코크", "사이다", "환타", "밀키스", "칠성", "논알콜", "탐스제로", "핫식스", "탑씨", "웰치", "토닉", "무알콜", "스프라이트", "알콜", "맥주"]:
            if i in string: return "탄산"
        #커피
        for i in ["모카", "에스프레소", "할리스", "블랙커피", "커피", "맥심", "카페", "아메리카노", "로스트", "콜롬비아", "맥스웰", "조지아", "이디야", "라떼", "스타벅스", "믹스커피", "원두", "에티오피아", "카페인", "캡슐", "칸타타", "멕스웰", "카누", "바리스타", "다비도프", "순수"]:
            if i in string: return "커피"
        #건강음료
        for i in ["홍삼", "즙", "액", "바이오", "비타", "비타민", "미에로", "건강", "정관장", "제약"]:
            if i in string: return "건강음료"
        # 생수/탄산수
        for i in ["삼다수","샘물","에비앙","물","트레비","칠성","코카","콜라","펩시","사이다","아이시스","씨그램","탄산","탄산수","워터","나랑드","심층수","생수","백산수","수"]:
            if i in string: return "생수/탄산수"
        # 차
        for i in ["쌍화", "차", "미숫가루", "율무차", "히비스커스", "자몽", "말차", "청", "립톤", "잉글리쉬", "둥글레", "캐모마일", "페퍼민트", "런던프릇", "아이스티", "에이드", "보리", "옥수수", "자스민", "로즈마리", "허브", "얼그레이", "국화", "유자", "유자차", "메밀차", "라이트티", "티", "잉글리시", "브렉퍼스트", "라이트티", "밀크티", "콤부"]: 
            if i in string: return "차"   
        # 코코아/핫초코
        for i in ["코코아", "핫초코", "제티", "초코", "초콜릿", "딸기맛", "네슬레", "파우더", "밀크티", "네스퀵"]: 
            if i in string: return "코코아/핫초코" 
        # 꿀
        for i in ["꿀", "벌", "허니", "시럽", "메이플"]: 
            if i in string: return "꿀"
        #과일/야채음료(배)
        for i in ["배"]:
            if i in string: return "과일/야채음료"

        return "기타음료"

    # 과일
    def fruit(self, string):     
        # 귤
        for i in ["귤", "밀감", "낑", "낑깡", "밀감"]:  
            if i in string: return "귤"
        #오렌지
        for i in ["오렌지"]:  
            if i in string: return "오렌지"
        #사과
        for i in ["사과"]:  
            if i in string: return "사과"
        # 감/홍시
        for i in ["감", "홍시", "단감"]:  
            if i in string: return "감/홍시"
        # 토마토
        for i in ["토마토", "마토"]:  
            if i in string: return "토마토"
        # 딸기     
        for i in ["딸기"]:  
            if i in string: return "딸기"
        # 베리류 
        for i in ["베리", "오미자"]:  
            if i in string: return "베리류"
        # 포도         
        for i in ["머스켓", "머스캣","머스킷", "포도", "거봉", "머스켓"]:  
            if i in string: return "포도"
        # 참외         
        for i in ["참외"]:  
            if i in string: return "참외"
        # 무화과 
        for i in ["무화과","모과"]:  
            if i in string: return "무화과"
        # 키위
        for i in ["키위"]:  
            if i in string: return "키위"
        # 파인애플        
        for i in ["파인애플"]:  
            if i in string: return "파인애플"
        # 레몬/라임        
        for i in ["레몬", "라임"]:  
            if i in string: return "레몬/라임"
        # 석류        
        for i in ["석류"]:  
            if i in string: return "석류"
        # 아보카도        
        for i in ["아보카도"]:  
            if i in string: return "아보카도"
        # 견과/밤        
        for i in ["견과", "호두", "아몬드", "밤", "땅콩", "너트", "HBAF"]:  
            if i in string: return "견과/밤"
        # 기타만감류
        for i in ["향"]:  
            if i in string: return "기타만감류"
        # 배
        for i in ["배"]:  
            if i in string: return "배"  
        # 바나나      
        for i in ["바나나"]:  
            if i in string: return "바나나" 
        # 열대과일      
        for i in ["망고", "용과", "두리안", "후르츠", "열대"]:  
            if i in string: return "열대과일" 

        return "기타과일"        